Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotSwitchToCurtainWall Property
 Can't switch type to Curtain Wall after Edit Elevation Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSwitchToCurtainWall { get; }
Public Shared ReadOnly Property CannotSwitchToCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSwitchToCurtainWall {
	FailureDefinitionId^ get ();
}
static member CannotSwitchToCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace